Pandas Function

In [3]:
import pandas as pd
csv_1 = pd.read_csv("C:\\Users\\HP Pavilion\\OneDrive\\Desktop\\Portfolio\\Python\\Pandas\\Test_new1.csv")
csv_1

   a   b   c
0  1   7  13
1  2   8  14
2  3   9  15
3  4  10  16
4  5  11  17
5  6  12  20

In [4]:
csv_1.index

RangeIndex(start=0, stop=6, step=1)

In [5]:
csv_1.columns

Index(['a', 'b', 'c'], dtype='object')

In [6]:
csv_1.describe()

              a          b          c
count  6.000000   6.000000   6.000000
mean   3.500000   9.500000  15.833333
std    1.870829   1.870829   2.483277
min    1.000000   7.000000  13.000000
25%    2.250000   8.250000  14.250000
50%    3.500000   9.500000  15.500000
75%    4.750000  10.750000  16.750000
max    6.000000  12.000000  20.000000

In [7]:
csv_1.head(2)

   a  b   c
0  1  7  13
1  2  8  14

In [8]:
csv_1.tail(2)

   a   b   c
4  5  11  17
5  6  12  20

In [9]:
csv_1["c"][1:3]

1    14
2    15
Name: c, dtype: int64

In [10]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [15]:
csv_1.index.array

<NumpyExtensionArray>
[np.int64(0), np.int64(1), np.int64(2), np.int64(3), np.int64(4), np.int64(5)]
Length: 6, dtype: int64

In [16]:
csv_1.to_numpy()

array([[ 1,  7, 13],
       [ 2,  8, 14],
       [ 3,  9, 15],
       [ 4, 10, 16],
       [ 5, 11, 17],
       [ 6, 12, 20]])

In [19]:
import numpy as np
v= np.asarray(csv_1)
v

array([[ 1,  7, 13],
       [ 2,  8, 14],
       [ 3,  9, 15],
       [ 4, 10, 16],
       [ 5, 11, 17],
       [ 6, 12, 20]])

In [20]:
csv_1.sort_index(axis=0, ascending= False)

   a   b   c
5  6  12  20
4  5  11  17
3  4  10  16
2  3   9  15
1  2   8  14
0  1   7  13

In [23]:
csv_1.loc[0,"a"]=34
csv_1

    a   b   c
0  34   7  13
1   2   8  14
2   3   9  15
3   4  10  16
4   5  11  17
5   6  12  20

In [24]:
csv_1.loc[[2,3],["a","b"]]

   a   b
2  3   9
3  4  10

In [26]:
csv_1.loc[:,["a","b"]]

    a   b
0  34   7
1   2   8
2   3   9
3   4  10
4   5  11
5   6  12

In [29]:
csv_1.iloc[2,2]

c    15
Name: 2, dtype: object

In [30]:
csv_1.drop("c",axis=1)

    a   b
0  34   7
1   2   8
2   3   9
3   4  10
4   5  11
5   6  12

In [31]:
csv_1.drop(1,axis=0)

    a   b   c
0  34   7  13
2   3   9  15
3   4  10  16
4   5  11  17
5   6  12  20